In [124]:
import pandas as pd
import numpy as np

In [125]:
#create df with excel file; specifically look at columns: 'STATE','COUNTY','FFR16','FSR16'
df = pd.read_excel(r'C:\Users\nickf\OneDrive\Desktop\project1\FoodEnvironmentAtlas.xls', sheet_name='RESTAURANTS')
df1 = pd.DataFrame(df, columns= ['STATE','COUNTY','FFR16','FSR16'])
# df1['COUNTY'] = df1['COUNTY'].apply(str)
# df1['STATE'] = df1['STATE'].apply(str)
df1.head()

   STATE  COUNTY  FFR16  FSR16
0    NaN     NaN     44     31
1    NaN     NaN    156    236
2    NaN     NaN     23     14
3    NaN     NaN      7      7
4    NaN     NaN     23     12

In [116]:
#look at above dataframe but only pull from "state" column
df2 = pd.DataFrame(df, columns = ['STATE']) #,'COUNTY'])
df2.head()

   STATE
0    NaN
1    NaN
2    NaN
3    NaN
4    NaN

In [103]:
#look at data types
# df2["STATE"].dtype
print (df1.dtypes)

STATE     object
COUNTY    object
FFR16      int64
FSR16      int64
dtype: object

In [123]:
#CHANGE DATA TYPES FROM 'FLOAT64' TO OBJECT

# Now we will convert it from  
# 'float' to 'String' type.  

df1['STATE'] = df1['STATE'].astype(str) 
df1['COUNTY'] = df1['COUNTY'].astype(str)

# data_types_dict = {'STATE': str}
    
# print() 
  
# lets find out the data 
# type after changing 
print(df1.dtypes) 
  
# print dataframe.  
df1.head()

STATE     object
COUNTY    object
FFR16      int64
FSR16      int64
dtype: object

  STATE COUNTY  FFR16  FSR16
0   nan    nan     44     31
1   nan    nan    156    236
2   nan    nan     23     14
3   nan    nan      7      7
4   nan    nan     23     12

In [120]:
#CHANGE COLUMN NAMES

df_new = df1.rename(columns={"FFR16": "Fast Food Restaurants '16","FSR16":"Full-Service Restaurants '16","STATE":"State","COUNTY":"County"})
df_new.head()

  State County  Fast Food Restaurants '16  Full-Service Restaurants '16
0   nan    nan                         44                            31
1   nan    nan                        156                           236
2   nan    nan                         23                            14
3   nan    nan                          7                             7
4   nan    nan                         23                            12